package com.example.user.javacoretraining.collections;

public interface CollectionsBlock {

    /**
     * Даны два упорядоченных по невозрастанию списка.
     * Объедините их в новый упорядоченный по невозрастанию список.
     */

    /**
     * Дан список. После каждого элемента добавьте предшествующую ему часть списка.
     */

    /**
     * Даны два списка. Определите, совпадают ли множества их элементов.
     */

    /**
     * Создать список из заданного количества элементов.
     * Выполнить циклический сдвиг этого списка на N элементов вправо или влево.
     */

    /**
     * Создать два стека и поменять информацию местами.
     */

    /**
     * Дан список студентов. Элемент списка содержит фамилию, имя, отчество, год рождения,
     * курс, номер группы, оценки по пяти предметам. Заполните список и выполните задание.
     * Упорядочите студентов по курсу, причем студенты одного курса располагались
     * в алфавитном порядке. Найдите средний балл каждой группы по каждому предмету.
     * Определите самого старшего студента и самого младшего студентов.
     * Для каждой группы найдите лучшего с точки зрения успеваемости студента.
     */
}
